Public Attributes | List of all members
API_DescriptorType Struct Reference
Old Listing
Description of a descriptor. More...
#include <APIdefs_ListData.h>
 Public Attributes
API_ListData_Head  | head
Contains the header information, including type, set index and index.
char  | code [API_DBCodeLen]
Descriptor code.
char  | keycode [API_DBCodeLen]
Descriptor key code.
char  | dbSetName [API_DBCodeLen]
Descriptor database set name.
char **  | name
name of the descriptor
Detailed Description
Description of a descriptor.
Remarks
This stucture is used when you get or search a descriptor in the listing database. See the ACAPI_OldListing_Get, ACAPI_OldListing_GetLocal and ACAPI_OldListing_Search functions. Remember to dispose of the name handle when you are done.
Member Data Documentation
◆ code
 API_DescriptorType::code
Descriptor code.
◆ dbSetName
 API_DescriptorType::dbSetName
Descriptor database set name.
◆ head
 API_DescriptorType::head
Contains the header information, including type, set index and index.
◆ keycode
 API_DescriptorType::keycode
Descriptor key code.
◆ name
 API_DescriptorType::name
name of the descriptor